{
  "releases": {
    "layout": "_page",

    "releases": [
      {
        "notes": "",
        "date": "July 27, 2022",
        "version": "1.1.0.1",
        "type": "Enhancement",
        "upgrade": {
          "description": "Run 'composer update' to add 'doctrine/dbal' in order to alter the column size and 'php artisan migration' to change the app and workflow descriptions columns "
        },
        "breaking": [],
        "features": [
          {
            "issues": ["56"],
            "tags": ["Workflows", "microApps"],
            "description": "Requires the slugs for microApp and workflow instances within a group to be unique to prevent collisions"
          },
          {
            "issues": ["67"],
            "tags": ["Workflows", "microApps", "gateway Apis"],
            "description": "Validate uniqueness in MicroApp editor for Resource, Script, Template and Form names<br><br>Validate uniqueness in Workflow editor for Template, Method, Resources and Map names<br><br>Validate uniqueness in Api's for Route path/verb combinations and for Resource, Function and File names"
          },
          {
            "issues": ["120"],
            "tags": ["Workflows", "microApps", "gateway Apis"],
            "description": "Before leaveing the editors for microApps, workflows, or api's you are given a warning if you have unsaved changes"
          },
          {
            "issues": ["143"],
            "tags": ["microApps", "APIGateway"],
            "description": "Add PATCH as a verb to microApps in Graphene and to the APIGateway"
          },
          {
            "issues": ["174"],
            "tags": ["microApps", "APIGateway"],
            "description": "Increased the description length for microApps and workflows to 1000 characters and added validation to the input forms"
          }
        ],
        "performance": [],
        "bugs": [],
        "tests": [],
        "other": []
      }
    ],
    "old": [
      {
        "notes": "This release exchanges the master branch for the main branch. All branches are currently merged. All pull requests are merged as well. This is a new baseline and marks a change in the way releases will be managed, with frequency changing to a regular biweekly schedule.",
        "date": "July 14, 2022",
        "version": "1.1.0.0",
        "type": "Baseline",
        "upgrade": [{ "description": "" }],
        "breaking": [],
        "features": [
          {
            "issues": ["219"],
            "tags": ["Workflows"],
            "description": "Enable cache configuration of resouces in workflows"
          }
        ],
        "performance": [],
        "bugs": [
          {
            "issues": ["212"],
            "tags": ["Framework"],
            "description": "Merged pull request to fix unauthenticated navigation of public pages"
          },
          {
            "issues": ["214"],
            "tags": ["GrapheneDataGrid"],
            "description": "Fixes a problem when searching a field in a GrapheneDataGrid whose type has a default template that is not defined explicitly on the field instance."
          },
          {
            "issues": ["215"],
            "tags": ["GrapheneApiGateway"],
            "description": "Allow Api's in the GrapheneApiGateway be configured to have no (0) required parameters and handle that scenario in the gateway itself and the generated documentation as well."
          },
          {
            "issues": ["220"],
            "tags": ["Form Builder", "microApps", "Workflows"],
            "description": "Fix 'user' type field configuration by not parsing the search field unless it is populated - this fixes a current problem introduced in the last release but a better pattern should be defined"
          }
        ],
        "tests": [],
        "other": []
      }
    ]
  },
  "index": {},
  "release": {
    "layout": "_page"
  }
}
